In [14]:
#Importing the python libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import scipy.stats as stats

In [4]:
data = pd.read_csv("fuel_ferc1.csv")
data.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533.0,1.000,2.77,2.77,2.570

In [10]:
data_1 = data[['fuel_type_code_pudl','fuel_cost_per_unit_burned']]
data_1

      fuel_type_code_pudl  fuel_cost_per_unit_burned
0                    coal                      18.59
1                    coal                      18.58
2                    coal                      39.72
3                    coal                      47.21
4                     gas                       2.77
...                   ...                        ...
29518                 gas                       4.78
29519                 gas                       3.65
29520                 gas                       4.77
29521                coal                       3.06
29522                 gas                       0.00

[29523 rows x 2 columns]

In [11]:
data_1.groupby(['fuel_type_code_pudl'],as_index=False).mean()

  fuel_type_code_pudl  fuel_cost_per_unit_burned
0                coal                  67.421830
1                 gas                  13.659397
2             nuclear                4955.157002
3                 oil                 168.877086
4               other                  18.253856
5               waste                  19.518122

In [13]:
print("standard deviation of Fuel_mmbtu_per_unit :{0:.2f}".format(data.fuel_mmbtu_per_unit.std()))
print("75% percentile of Fuel_mmbtu_per_unit :{0:.2f}".format(data.fuel_mmbtu_per_unit.quantile(0.75)))

standard deviation of Fuel_mmbtu_per_unit :10.60
75% percentile of Fuel_mmbtu_per_unit :17.01

In [18]:
#kurtosis_scipy = stats.kurtosis(data.fuel_qty_burned)
#kurtosis_pandas = pd.DataFrame(fuel_qty_burned).kurtosis()[0]

#skew_scipy = stats.skew(data.fuel_qty_burned)
#skew_pandas = pd.DataFrame(fuel_qty_burned).skew()[0]
#print(skew_scipy, skew_pandas)

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29523 entries, 0 to 29522
Data columns (total 11 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   record_id                     29523 non-null  object
 1   utility_id_ferc1              29523 non-null  int64
 2   report_year                   29523 non-null  int64
 3   plant_name_ferc1              29523 non-null  object
 4   fuel_type_code_pudl           29523 non-null  object
 5   fuel_unit                     29343 non-null  object
 6   fuel_qty_burned               29523 non-null  float64
 7   fuel_mmbtu_per_unit           29523 non-null  float64
 8   fuel_cost_per_unit_burned     29523 non-null  float64
 9   fuel_cost_per_unit_delivered  29523 non-null  float64
 10  fuel_cost_per_mmbtu           29523 non-null  float64
dtypes: float64(5), int64(2), object(4)
memory usage: 2.5+ MB

In [23]:
data.fuel_unit.isnull().value_counts()

False    29343
True       180
Name: fuel_unit, dtype: int64

In [27]:
((data.fuel_unit.isnull().sum())/(data.fuel_unit.value_counts().sum()))*100

0.6134342091810653